# import data

In [1]:
import pandas as pd
import numpy as np
import glob

In [3]:
n=0
list_data=[]
for name in glob.glob('/Users/yoga/Documents/Projects/10Eco_applied eco_replicate mini wage/SIPP/targted file new/*.csv'):
    n=n+1
    data_i=pd.read_csv(name)
#     print(n,name)
    list_data.append(data_i)

/Users/yoga/opt/anaconda3/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3071: DtypeWarning: Columns (13) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [16]:
all_data=pd.concat(list_data)

In [17]:
all_data[1:2]

,ssuid,tage,tpyrate1,tfipsst,euectyp5,eawop,rmhrswk,ehrsall,ehrsbs1,ehrsbs2,thearn,thtotinc,rhpov,rfpov,rfownkid,eeducate,rhcalmn,rhcalyr
1,19128000276,31,Not in universe or none,Florida,Not in Universe,Not in Universe,"Did not work (did not have a job,",Not in Universe,Not in Universe,Not in Universe,0,252,1477,1477,1,Bachelor's degree (for example:,January,2011

In [18]:
# all_data.to_csv('/Users/yoga/Documents/Projects/10Eco_applied eco_replicate mini wage/SIPP/targted file new/new_combine all data.csv',index=0)

# process the data

In [19]:
#filter age between 16 and 64
# wave11age=wave11.loc[(wave11['tage'].astype(int)<65) and (wave11['tage'].astype(int)>15)]
# wave11age
all_data2=all_data[all_data['tage']!='Less than 1 full year old']
all_data2['tage'] = all_data2['tage'].astype(int)

all_data2age = all_data2.loc[(all_data2['tage'] >= 16) & (all_data2['tage'] <= 64)]

<ipython-input-19-dc5ab34e5ae1>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  all_data2['tage'] = all_data2['tage'].astype(int)

In [20]:
all_data2age[1:2]

,ssuid,tage,tpyrate1,tfipsst,euectyp5,eawop,rmhrswk,ehrsall,ehrsbs1,ehrsbs2,thearn,thtotinc,rhpov,rfpov,rfownkid,eeducate,rhcalmn,rhcalyr
1,19128000276,31,Not in universe or none,Florida,Not in Universe,Not in Universe,"Did not work (did not have a job,",Not in Universe,Not in Universe,Not in Universe,0,252,1477,1477,1,Bachelor's degree (for example:,January,2011

In [21]:
#filter wage
filterwage=all_data2age[all_data2age['tpyrate1']!='Not in universe or none']
filterwage

,ssuid,tage,tpyrate1,tfipsst,euectyp5,eawop,rmhrswk,ehrsall,ehrsbs1,ehrsbs2,thearn,thtotinc,rhpov,rfpov,rfownkid,eeducate,rhcalmn,rhcalyr
16,19128000334,25,10,New York,Not in Universe,No,All weeks 35+,40,Not in Universe,Not in Universe,5000,5002,1228,1228,0,Bachelor's degree (for example:,January,2011
17,19128000334,25,10,New York,Not in Universe,No,All weeks 35+,40,Not in Universe,Not in Universe,5000,5002,1466,1466,1,Bachelor's degree (for example:,October,2010
18,19128000334,25,10,New York,Not in Universe,No,All weeks 35+,40,Not in Universe,Not in Universe,5000,5002,1220,1220,0,Bachelor's degree (for example:,November,2010
19,19128000334,25,10,New York,Not in Universe,No,All weeks 35+,40,Not in Universe,Not in Universe,5000,5002,1222,1222,0,Bachelor's degree (for example:,December,2010
29,19128000932,18,10,Louisiana,Not in Universe,Yes,All weeks 1-34 hours,20,Not in Universe,Not in Universe,8799,10584,1923,1923,2,11th Grade,January,2011
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
309394,955925986857,59,14.86999999999999922,New York,Not in Universe,Yes,At least 1 week but not all weeks,30,Not in Universe,Not in Universe,3112,3134,1280,1280,0,Associate (2-yr) college degree,June,2012
309415,955958986671,22,9.269999999999999574,California,Not in Universe,No,All weeks 1-34 hours,20,Not in Universe,Not in Universe,0,0,994,994,0,Bachelor's degree (for example:,March,2012
309416,955958986671,22,9.269999999999999574,California,Not in Universe,No,All weeks 1-34 hours,20,Not in Universe,Not in Universe,0,0,996,996,0,Bachelor's degree (for example:,May,2012
309417,955958986671,22,9.269999999999999574,California,Not in Universe,No,All weeks 1-34 hours,20,Not in Universe,Not in Universe,0,0,995,995,0,Bachelor's degree (for example:,June,2012
309418,955958986671,22,9.269999999999999574,California,Not in Universe,No,All weeks 1-34 hours,20,Not in Universe,Not in Universe,0,0,997,997,0,Bachelor's degree (for example:,April,2012

## aim to create figure 1

In [23]:
# seperate the group by wage 
wave1_filterwage=filterwage.copy()
# wave1_filterwage.iloc[1]['tpyrate1']
wave1_filterwage['tpyrate1'] =wave1_filterwage['tpyrate1'] .astype(float)
wave1_filterwage75=wave1_filterwage[wave1_filterwage['tpyrate1']<7.5]
wave1_filterwage849=wave1_filterwage[(wave1_filterwage['tpyrate1']<8.5)&(wave1_filterwage['tpyrate1']>=7.5)]
wave1_filterwage999=wave1_filterwage[(wave1_filterwage['tpyrate1']<10)&(wave1_filterwage['tpyrate1']>=8.5)]

### read the state data, bounded or not bounded

In [24]:
#next seperate into bounded and unbounded state

state=pd.read_csv('/Users/yoga/Dropbox/0 FSU/4_2022 fall/2_applied economics/3 replication of a paper eco/1_4_2008minimum_wage_by_states_clean.csv')

In [27]:
state2=state[['State','bounded']]
state_bounded=state2[state2['bounded']==1]
state_bounded_list=state_bounded['State'].tolist()

### seperate bounded state and not bounded state

In [28]:
#filter  bounded
wave1_filterwage75_bounded=wave1_filterwage75[wave1_filterwage75['tfipsst'].isin(state_bounded_list)]
wave1_filterwage849_bounded=wave1_filterwage849[wave1_filterwage849['tfipsst'].isin(state_bounded_list)]
wave1_filterwage999_bounded=wave1_filterwage999[wave1_filterwage999['tfipsst'].isin(state_bounded_list)]

In [29]:
#fiter not bounded data
wave1_filterwage75_nobounded=wave1_filterwage75[~wave1_filterwage75['tfipsst'].isin(state_bounded_list)]
wave1_filterwage849_nobounded=wave1_filterwage849[~wave1_filterwage849['tfipsst'].isin(state_bounded_list)]
wave1_filterwage999_nobounded=wave1_filterwage999[~wave1_filterwage999['tfipsst'].isin(state_bounded_list)]

In [37]:
#save the data of six groups 5.15-7.25 group

group_list=[wave1_filterwage75_nobounded,wave1_filterwage75_bounded,wave1_filterwage849_nobounded,
           wave1_filterwage849_bounded,wave1_filterwage999_nobounded,wave1_filterwage999_bounded]

targe_group725=[]
target_name=['filterwage75_nobounded725','filterwage75_bounded725',
            'filterwage849_nobounded725','filterwage849_bounded725',
            'filterwage999_nobounded725','filterwage999_bounded725',]

for i in range(len(group_list)):
    groupi=group_list[i]
#     namei=target_name[i]
    update725=groupi[(groupi['tpyrate1']>=5.15)&(groupi['tpyrate1']<=7.25)]
#     update725.to_csv(str(i)+namei+".csv",index=0)
    targe_group725.append(update725)

In [36]:
wave1_filterwage75_nobounded

,ssuid,tage,tpyrate1,tfipsst,euectyp5,eawop,rmhrswk,ehrsall,ehrsbs1,ehrsbs2,thearn,thtotinc,rhpov,rfpov,rfownkid,eeducate,rhcalmn,rhcalyr
856,19344123268,59,4.19,Florida,Not in Universe,No,All weeks 35+,55,Not in Universe,Not in Universe,5700,7097,1879,1879,1,"Some college, but no degree",October,2010
857,19344123268,59,4.19,Florida,Not in Universe,No,All weeks 35+,55,Not in Universe,Not in Universe,5700,7097,1883,1883,1,"Some college, but no degree",December,2010
858,19344123268,59,4.19,Florida,Not in Universe,No,All weeks 35+,55,Not in Universe,Not in Universe,5700,7097,1880,1880,1,"Some college, but no degree",November,2010
859,19344123268,59,4.19,Florida,Not in Universe,No,All weeks 35+,55,Not in Universe,Not in Universe,5700,7097,1892,1892,1,"Some college, but no degree",January,2011
1098,19344246159,17,7.00,Florida,Not in Universe,No,All weeks 1-34 hours,10,Not in Universe,Not in Universe,10130,10264,1466,1466,1,10th Grade,October,2010
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
308886,955925944720,16,7.25,New York,Not in Universe,No,"Did not work (did not have a job,",12,Not in Universe,Not in Universe,8766,8771,2009,2009,2,11th Grade,April,2012
309051,955925975196,23,2.65,Michigan,Not in Universe,Yes,All weeks 1-34 hours,25,Not in Universe,Not in Universe,1600,1602,996,996,0,"Some college, but no degree",May,2012
309052,955925975196,23,2.65,Michigan,Not in Universe,Yes,All weeks 1-34 hours,25,Not in Universe,Not in Universe,2400,2402,997,997,0,"Some college, but no degree",April,2012
309053,955925975196,23,2.65,Michigan,Not in Universe,Yes,At least 1 week but not all weeks,25,Not in Universe,Not in Universe,1500,1502,995,995,0,"Some college, but no degree",June,2012
309054,955925975196,22,2.65,Michigan,Not in Universe,Yes,All weeks 1-34 hours,25,Not in Universe,Not in Universe,2700,2702,994,994,0,"Some college, but no degree",March,2012

In [45]:
len(targe_group725[0])

21116

In [47]:
targe_group725[0]['tage'].mean()

27.722580034097366

In [52]:
more_high_school=['Some college, but no degree',
                  'High School Graduate - (diploma',
                  "Bachelor's degree (for example:",
                  'Associate (2-yr) college degree',
                  "Master's degree (For example: MA,",
                  'Professional School degree (for',
                  'Doctorate degree (for example:' 
                 ]

In [53]:
highschool_more=group_list[0][group_list[0]['eeducate'].isin(more_high_school)]

In [55]:
len(highschool_more)

22477

In [57]:
len(group_list[0])

33807

In [51]:
group_list[0]['eeducate'].unique().tolist()

['Some college, but no degree',
 '10th Grade',
 'High School Graduate - (diploma',
 '12th grade, no diploma',
 "Bachelor's degree (for example:",
 '11th Grade',
 'Associate (2-yr) college degree',
 'Diploma or certificate from a',
 '7th Or 8th Grade',
 '9th Grade',
 '5th Or 6th Grade',
 "Master's degree (For example: MA,",
 'Less Than 1st Grade',
 '1st, 2nd, 3rd or 4th grade',
 'Professional School degree (for',
 'Doctorate degree (for example:']

In [ ]:
more_high_school=['Some college, but no degree',
                  'High School Graduate - (diploma',
                  "Bachelor's degree (for example:",
                  'Associate (2-yr) college degree',
                  "Master's degree (For example: MA,",
                  'Professional School degree (for',
                  'Doctorate degree (for example:' 
                 ]

In [64]:
#calculate the statistics in the table 1
individual=[]
observation=[]
agemean=[]
agestd=[]
childmean=[]
childstd=[]
incomemean=[]
incomestd=[]
hourmean=[]
hourstd=[]
highschoolmean=[]
highschoolstd=[]
wage515_725=[]
employed=[]
df=pd.DataFrame(columns=['number of individuals'])


for i in range(len(group_list)):
    fenmu=group_list[i]
    fenzi=targe_group725[i]
    individual_i=fenzi['ssuid'].nunique()
    individual.append(individual_i)
    
#     observation_i=len(fenzi)
#     observation.append(observation_i)
    
#     agei=fenzi['tage'].mean()
#     agemean.append(agei)
#     agestdi=fenzi['tage'].std()
#     agestd.append(agestdi)
    
#     childi=fenzi['rfownkid'].mean()
#     childmean.append(childi)
#     child_stdi=fenzi['rfownkid'].std()
#     childstd.append(child_stdi)
    
#     incomei= fenzi['thtotinc'].mean()
#     incomemean.append(incomei)
#     incomestdi= fenzi['thtotinc'].std()
#     incomestd.append(incomestdi)
    
#     houri= fenzi['ehrsall'].mean()
#     hourmean.append(houri)

#     houristdi=fenzi['ehrsall'].std()
#     houristd.append(houristdi)
    
#     highschool_more=fenzi[group_list['eeducate'].isin(more_high_school)]
#     number_highschool=len(highschool_more)
#     percentage_highschool=number_highschool/observation_i
#     highschoolmean.append(percentage_highschool)
    
    df = df.append({'number of individuals': individual_i},ignore_index=True)

In [68]:
targe_group725[3]

Empty DataFrame
Columns: [ssuid, tage, tpyrate1, tfipsst, euectyp5, eawop, rmhrswk, ehrsall, ehrsbs1, ehrsbs2, thearn, thtotinc, rhpov, rfpov, rfownkid, eeducate, rhcalmn, rhcalyr]
Index: []

In [66]:
group_list[2]

,ssuid,tage,tpyrate1,tfipsst,euectyp5,eawop,rmhrswk,ehrsall,ehrsbs1,ehrsbs2,thearn,thtotinc,rhpov,rfpov,rfownkid,eeducate,rhcalmn,rhcalyr
588,19228740089,31,7.50,Florida,Not in Universe,No,All weeks 35+,35,Not in Universe,Not in Universe,3524,3524,2300,2300,0,High School Graduate - (diploma,November,2010
589,19228740089,31,7.50,Florida,Not in Universe,No,All weeks 35+,35,Not in Universe,Not in Universe,3524,3524,2315,2315,0,High School Graduate - (diploma,January,2011
590,19228740089,31,7.50,Florida,Not in Universe,No,All weeks 35+,35,Not in Universe,Not in Universe,3524,3524,2304,2304,0,High School Graduate - (diploma,December,2010
591,19228740089,31,7.50,Florida,Not in Universe,No,All weeks 35+,35,Not in Universe,Not in Universe,3524,3524,2299,2299,0,High School Graduate - (diploma,October,2010
596,19228740089,26,8.00,Florida,Not in Universe,No,All weeks 35+,35,Not in Universe,Not in Universe,3524,3524,2300,2300,0,High School Graduate - (diploma,November,2010
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
308726,955925944023,21,7.65,Michigan,Not in Universe,Yes,"Did not work (did not have a job,",40,Not in Universe,Not in Universe,177,4477,2418,2418,2,Associate (2-yr) college degree,April,2012
309287,955925986138,21,7.80,Michigan,Not in Universe,No,All weeks 1-34 hours,18,Not in Universe,Not in Universe,12503,12847,2009,2009,2,"Some college, but no degree",April,2012
309288,955925986138,22,7.80,Michigan,Not in Universe,No,All weeks 1-34 hours,18,Not in Universe,Not in Universe,12503,12847,2004,2004,2,"Some college, but no degree",June,2012
309289,955925986138,21,7.80,Michigan,Not in Universe,No,All weeks 1-34 hours,18,Not in Universe,Not in Universe,12503,12847,2003,2003,2,"Some college, but no degree",March,2012
309290,955925986138,21,7.80,Michigan,Not in Universe,No,All weeks 1-34 hours,18,Not in Universe,Not in Universe,12503,12847,2007,2007,2,"Some college, but no degree",May,2012

In [74]:
df=pd.DataFrame()
for i in range(len(group_list)):
    fenmu=group_list[i]
    fenzi=targe_group725[i]
    individual_i=fenzi['ssuid'].nunique()
    print(individual_i)
#     individual.append(individual_i)
    df = df.append({'number of individuals': individual_i},ignore_index=True)

1936
2963
0
0
0
0

In [75]:
targe_group725[2]

Empty DataFrame
Columns: [ssuid, tage, tpyrate1, tfipsst, euectyp5, eawop, rmhrswk, ehrsall, ehrsbs1, ehrsbs2, thearn, thtotinc, rhpov, rfpov, rfownkid, eeducate, rhcalmn, rhcalyr]
Index: []

## read in the combined data

In [4]:
combine=pd.read_csv('/Users/yoga/Documents/Projects/10Eco_applied eco_replicate mini wage/SIPP/targted file new/new_combine all data.csv')

In [5]:
combine

,ssuid,tage,tpyrate1,tfipsst,euectyp5,eawop,rmhrswk,ehrsall,ehrsbs1,ehrsbs2,thearn,thtotinc,rhpov,rfpov,rfownkid,eeducate,rhcalmn,rhcalyr
0,19128000276,31,Not in universe or none,Florida,Not in Universe,Not in Universe,"Did not work (did not have a job,",Not in Universe,Not in Universe,Not in Universe,0,252,1467,1467,1,Bachelor's degree (for example:,November,2010
1,19128000276,31,Not in universe or none,Florida,Not in Universe,Not in Universe,"Did not work (did not have a job,",Not in Universe,Not in Universe,Not in Universe,0,252,1477,1477,1,Bachelor's degree (for example:,January,2011
2,19128000276,31,Not in universe or none,Florida,Not in Universe,Not in Universe,"Did not work (did not have a job,",Not in Universe,Not in Universe,Not in Universe,0,252,1466,1466,1,Bachelor's degree (for example:,October,2010
3,19128000276,31,Not in universe or none,Florida,Not in Universe,Not in Universe,"Did not work (did not have a job,",Not in Universe,Not in Universe,Not in Universe,0,252,1470,1470,1,Bachelor's degree (for example:,December,2010
4,19128000276,34,Not in universe or none,Florida,Not in Universe,Not in Universe,"Did not work (did not have a job,",Not in Universe,Not in Universe,Not in Universe,0,252,1477,1477,1,Bachelor's degree (for example:,January,2011
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4221114,955958398688,5,Not in universe or none,California,Not in Universe,Not in Universe,Not in Universe,Not in Universe,Not in Universe,Not in Universe,10000,10263,2284,2284,3,Not in Universe,May,2012
4221115,955958986671,22,9.269999999999999574,California,Not in Universe,No,All weeks 1-34 hours,20,Not in Universe,Not in Universe,0,0,994,994,0,Bachelor's degree (for example:,March,2012
4221116,955958986671,22,9.269999999999999574,California,Not in Universe,No,All weeks 1-34 hours,20,Not in Universe,Not in Universe,0,0,996,996,0,Bachelor's degree (for example:,May,2012
4221117,955958986671,22,9.269999999999999574,California,Not in Universe,No,All weeks 1-34 hours,20,Not in Universe,Not in Universe,0,0,995,995,0,Bachelor's degree (for example:,June,2012
4221118,955958986671,22,9.269999999999999574,California,Not in Universe,No,All weeks 1-34 hours,20,Not in Universe,Not in Universe,0,0,997,997,0,Bachelor's degree (for example:,April,2012